In [1]:
import pandas as pd

s1 = pd.Series({'김' : 100, '나' : 141, '박' : 129, '이' : 124}) # dict형식
s1.name = '수학' # s1에 이름을 붙임 -> 하단에 name 출력
print(s1)

김    100
나    141
박    129
이    124
Name: 수학, dtype: int64

In [2]:
s2 = pd.Series({'김' : 30, '나' : 5, '박' : 1239, '이' : 131}) # 이름 설정 x
print(s2)
s3 = pd.Series([8, 3, 13, 2]) # list로 추가 -> 0, 1, 2, 3으로 구분
s3.name = '국어'
print(s3)
s4 = pd.Series([30, 5, 1239, 141])
print(s4)

김      30
나       5
박    1239
이     131
dtype: int64
0     8
1     3
2    13
3     2
Name: 국어, dtype: int64
0      30
1       5
2    1239
3     141
dtype: int64

# 데이터프레임

In [3]:
df = pd.DataFrame({ # dataframe
    '출생지' : ['한국', '미국'],
    '나이' : [20, 30]
})
print(df)

  출생지  나이
0  한국  20
1  미국  30

In [4]:
df['성별'] = ['여', '남자'] # '성별'이라는 열 추가
df # 표처럼 출력

  출생지  나이  성별
0  한국  20   여
1  미국  30  남자

In [5]:
df.loc[2] = ['일본', 25, '여'] # 행 추가

In [6]:
df

  출생지  나이  성별
0  한국  20   여
1  미국  30  남자
2  일본  25   여

In [7]:
df2 = pd.DataFrame(s1)

In [8]:
df2

    수학
김  100
나  141
박  129
이  124

In [9]:
df2['영어'] = s2 # 열 추가
df2['미술'] = [1,2,3,4]

In [10]:
df2

    수학    영어  미술
김  100    30   1
나  141     5   2
박  129  1239   3
이  124   131   4

In [11]:
df2[['수학', '미술']] # 워하는 열만 출력할 때 -> 대괄호 2개

    수학  미술
김  100   1
나  141   2
박  129   3
이  124   4

In [12]:
df2

    수학    영어  미술
김  100    30   1
나  141     5   2
박  129  1239   3
이  124   131   4

In [13]:
print(s1)

김    100
나    141
박    129
이    124
Name: 수학, dtype: int64

In [15]:
df2.loc[['김', '박']]

    수학    영어  미술
김  100    30   1
박  129  1239   3

In [17]:
df2.loc[['김'], ['미술']] # '김'행의 '미술'열 데이터만 출력

   미술
김   1

In [18]:
df2

    수학    영어  미술
김  100    30   1
나  141     5   2
박  129  1239   3
이  124   131   4

In [20]:
df2.sum() # 수학, 영어, 미술에 대한 합계 출력

수학     494
영어    1405
미술      10
dtype: int64

In [21]:
df2.mean()

수학    123.50
영어    351.25
미술      2.50
dtype: float64

In [22]:
df2.sum(axis = 1) # 기준점 변경 : 수학만 가지고 계산

김     131
나     148
박    1371
이     259
dtype: int64

# mission1

In [26]:
df2.loc[df2['영어'] >= 100, '수학'].mean()
# df2에서의 영어 점수 중 100점 이상인 행의 수학점수들의 평균값 출력
# 1. 100점 이상의 영어점수인 행 추출 : df2['영어'] >= 100
# 2. 그 행들의 수학점수 추출 df2.loc[df2['영어'] >= 100, '수학']
# 3. 해당 데이터의 평균값 출력 df2.loc[df2['영어'] >= 100, '수학'].mean()

126.5